{
    "instance_id": "0c1112-Async_Generator",
    "problem_statement": "The async_generator module provides an asynchronous generator that depends on time delays and random number generation, making its behavior non-deterministic and difficult to verify through manual testing. Without automated tests, there is no reliable way to ensure that the function yields the correct number of values, respects the expected timing behavior, or produces outputs within the required range. Testing the function manually would be slow due to real time delays and would produce inconsistent results because of randomness. A structured suite of unit tests is therefore necessary to validate the correctness of the generator logic, confirm proper asynchronous behavior, and ensure future code changes do not introduce regressions.",
    "requirements": [
        "1. The module must implement an asynchronous generator function",
        "2. The generator must yield exactly 10 values",
        "3. The generator must wait asynchronously for 1 second before each yield",
        "4. The generator must produce random numbers between 0 and 10",
        "5. Each yielded value must be of type float",
        "6. The function must be compatible with asyncio event loops",
        "7. The function must be testable without real time delays",
        "8. The function must be testable without relying on real randomness",
        "9. The code must support automated unit testing"
    ],
    "base_commit": "repository_before",
    "test_patch": "tests/",
    "github_url": "https://github.com/eaglepoint-ai/sample-dataset/tree/main/0c1112-Async_Generator",
    "environment_setup": "Dockerfile",
    "FAIL_TO_PASS": [
        "tests/test_async_generator.py::test_generator_yields_correct_count",
        "tests/test_async_generator.py::test_generator_yields_floats",
        "tests/test_async_generator.py::test_generator_values_in_range",
        "tests/test_async_generator.py::test_generator_respects_delay",
        "tests/test_async_generator.py::test_generator_uses_random_function",
        "tests/test_async_generator.py::test_generator_custom_count",
        "tests/test_async_generator.py::test_generator_custom_delay",
        "tests/test_async_generator.py::test_generator_custom_range",
        "tests/test_async_generator.py::test_generator_works_with_asyncio_loop"
    ],
    "PASS_TO_PASS": [
        "tests/test_async_generator.py::test_generator_exists",
        "tests/test_async_generator.py::test_generator_is_async"
    ]
}
